[
  {
    "projectId": "zencontrol",
    "title": "ZenControl",
    "slug": "why-zencontrol",
    "date": "2024-12-06",
    "tags": ["Automation", "Android", "Kotlin", "Accessibility"],
    "content": "### Trigger\n\nMy phone slipped from my hand, and the display shattered beyond use. The device still worked, but I was blind. Calls kept coming in, messages kept piling up, and I couldn’t respond. Buying a new phone wasn’t an option, so I was stuck with a fully functioning device that I could do nothing with.\n\n### Pain\n\nEvery day was the same routine: people trying to reach me, and me failing to reach back. I wasn’t without a phone — I was trapped behind a broken screen. It felt ridiculous that a slab of working hardware was useless just because I couldn’t tap on the right pixels. I needed access, not sympathy.\n\n### Turning Point\n\nI realized that if the screen was the problem, then I didn’t need a new phone — I needed a new way to control it. I started with the bare minimum: an app that could dial pre-stored contacts and answer incoming calls. It wasn’t pretty, but it gave my phone a pulse again. That tiny victory changed everything.\n\n### What I Built\n\nThe first version was simple: calls in and calls out without touching the display. Then I expanded it — music control, toggling features, basic automation. With each update, the screen mattered less. Eventually the idea shifted from controlling a broken phone to controlling a phone hands-free.\nThat’s when ZenControl was born — a personal on-device assistant that executes commands directly:\n\n“Turn on the hotspot.”\n\n“Play music.”\n\n“Call Dad.”\n\nNo typing, no swiping — just intent → action.\n\n### Impact\n\nInstead of buying a replacement phone, I repurposed the broken one into something more powerful than before. ZenControl didn’t just save me money — it gave me control in situations where touchscreens normally fail: driving, multitasking, accessibility, and low-vision scenarios. The device transformed from unusable to effortless.\n\n### What It Taught Me\n\nLimitations aren’t obstacles — they’re pressure. They force clarity and innovation. ZenControl started because I couldn’t afford a new phone. It grew because I refused to settle for inconvenience. Now I look at every problem with one question:\nIs this truly impossible — or just inconvenient enough that people learn to live with it?"
  }
]
